## Imports

In [6]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split

## Load Data

In [11]:
salary = pd.read_csv('eda_salary.csv', index_col=0)

In [12]:
salary.head()

,experience_level,salary_in_usd,remote_ratio,company_size,company_continent,employee_continent
0,EN,75000,100,M,NAM,NAM
1,EN,60000,100,M,NAM,NAM
2,MI,185700,0,M,NAM,NAM
3,MI,165000,0,M,NAM,NAM
4,SE,160000,100,M,NAM,NAM

In [17]:
salary['remote_ratio'] = salary['remote_ratio'].astype('object')

In [18]:
salary.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3037 entries, 0 to 3036
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   experience_level    3037 non-null   object
 1   salary_in_usd       3037 non-null   int64
 2   remote_ratio        3037 non-null   object
 3   company_size        3037 non-null   object
 4   company_continent   3037 non-null   object
 5   employee_continent  3037 non-null   object
dtypes: int64(1), object(5)
memory usage: 166.1+ KB

In [19]:
salary.head().T

                        0      1       2       3       4
experience_level       EN     EN      MI      MI      SE
salary_in_usd       75000  60000  185700  165000  160000
remote_ratio          100    100       0       0     100
company_size            M      M       M       M       M
company_continent     NAM    NAM     NAM     NAM     NAM
employee_continent    NAM    NAM     NAM     NAM     NAM

### Dummies for Categorical Data

In [21]:
dummies = pd.get_dummies(salary)
dummies.head()

C:\Users\luisf\AppData\Local\Temp\ipykernel_13380\2885102678.py:1: FutureWarning: In a future version, the Index constructor will not infer numeric dtypes when passed object-dtype sequences (matching Series behavior)
  dummies = pd.get_dummies(salary)

,salary_in_usd,experience_level_EN,experience_level_EX,experience_level_MI,experience_level_SE,remote_ratio_0,remote_ratio_50,remote_ratio_100,company_size_L,company_size_M,...,company_continent_EU,company_continent_NAM,company_continent_OC,company_continent_SA,employee_continent_AF,employee_continent_AS,employee_continent_EU,employee_continent_NAM,employee_continent_OC,employee_continent_SA
0,75000,1,0,0,0,0,0,1,0,1,...,0,1,0,0,0,0,0,1,0,0
1,60000,1,0,0,0,0,0,1,0,1,...,0,1,0,0,0,0,0,1,0,0
2,185700,0,0,1,0,1,0,0,0,1,...,0,1,0,0,0,0,0,1,0,0
3,165000,0,0,1,0,1,0,0,0,1,...,0,1,0,0,0,0,0,1,0,0
4,160000,0,0,0,1,0,0,1,0,1,...,0,1,0,0,0,0,0,1,0,0

### Standarization

Because all of our numerical data is in one column, 'salary_in_usd', which has only has one type currency (dollar), we will not be standarizing the values. This also helps with the interpretability, as our Y value will be predicted in dollars.

### Train Test Split

In [27]:
X = dummies.drop(columns=['salary_in_usd'])
y = dummies['salary_in_usd']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, train_size=0.8)

In [28]:
print(X_train.shape)
print(X_test.shape)

(2429, 22)
(608, 22)

In [30]:
print(y_train.shape)
print(y_test.shape)

(2429,)
(608,)

In [33]:
train_mean = y_train.mean()
train_std = y_train.std()
print(train_mean, train_std)

133636.21902017292 63717.470319909